Repository: eugeneai/papers-2019
Catalog: KONT/tr/en-ru/en-ru-omegat.tmx
Source language: en_us
Languages: ru_ru

source: Scenario is programmed as a special object defining transformation by means of calling |tr/N| rules.
ru_ru: Также сценарии можно реализовывать как упорядоченные наборы правил (методов) вида |tr/N|.

source: Scenarios are implemented as an ordered sets of methods.
ru_ru: Сценарии реализуются в виде упорядоченного набора методов.

source: Similar converter is realized for PIM represented in UML.
ru_ru: Аналогичный конвертер разработан и для PIM, представляемой диаграммами UML.

source: Similar to ATL, Transformation Model Representation Language (TMRL) is developed in but oriented on visual representation of a knowledge base with following conversion in various production rules in CLIPS and OWL.
ru_ru: Аналогично ATL, Язык представления модели трансформации (Transformation Model Representation Language, TMRL) описанный в , но ориентированный на визуальное представление базы знаний с последующим преобразованием в продукционные правила CLIPS и OWL.

source: So the transformation modules can be used as a verification system for the sources.
ru_ru: Поэтому модули преобразования могут быть использованы в качестве верификации исходного кода Mothur.

source: Source models are converted into graphs of RDF and then processed with knowledge based system organized in a network of objects.
ru_ru: Исходные модели преобразуются в RDF-графы и, затем, обрабатываются системой знаний, структурированной в сеть объектов.

source: Special user interfaces were developed to control assignment a stereotype to an entity.
ru_ru: [[Разработаны специальные интерфейсы пользователя для управления перечнем стереотипов.]]

source: Static object instances are used for defining configurations, scenarios, interfaces to input and output targets (streams, models), graph databases, and other global compile time known entities.
ru_ru: Статические экземпляры используются для определения конфигураций, сценариев, интерфейсов к входной и выходной информации, базам данных онтологий, и другим глобальным сущностям, известным во время компиляции.

source: Static objects is defined and instantiated during compilation, dynamic ones are created with createobject/4 usually at runtime.
ru_ru: Статические объекты создаются при помощи отношения создания экземпляра во время компиляции, динамические -- создаются предикатом createobject/4 во время исполнения программы.

source: Static parameterized objects can be considered as third way of instantiation.
ru_ru: Статические параметризованные объекты можно рассматривать как третий способ создания экземпляров.

source: Stereotypes declare an extended set of properties for an object or relation, e.g., in UML Class Diagram stereotypes are used to define the kind of a class.
ru_ru: Стереотипы задают расширенный набор атрибутов для объекта или связи, например, в диаграмме классов UML стереотипы используются для задания разновидности класса.

source: Tag values allow one to associate a string value identified by a string key, which are somehow interpreted with a transformation procedure.
ru_ru: Теговые значения позволяют связать некоторое строковое значение с ключом (строкой), которые так или иначе интерпретируются с процедурой трансформации.

source: Technique of Transformation Implementation
ru_ru: Методика реализации трансформации

source: That's why we require either to store all the input model data in SW graphs of ontologies, or provide an interface representing the source model as the ontology graph.
ru_ru: Поэтому мы требуем, чтобы либо хранить все входные модели данных в виде графов СВ при помощи соответствующих онтологий, или создавать конвертер, представляющий исходные модели в виде таких графов.

source: The object of the research is the development of a technology for transformation implementation as knowledge based system and be capable to process heterogeneous model sources as a complex of CIM and PIM. The subject of the paper is to describe above proposed data representation and transformation techniques.
ru_ru: Объектом исследования является разработка технологии реализации трансформации как системы знаний такой, чтобы была возможность обработки модельных данных CIM и PIM из разнородных источников. Предметом статьи является описание предложенного выше представления данных и методов преобразования моделей.

source: The |code_block|--objects consist of source code string lines, structures denoting source code, objects, and other code blocks.
ru_ru: Объекты |code_block| внутри содержат строки исходного кода, структуры, из которых порождаются куски исходного кода, объекты LogTalk и другие блоки кода.

source: The LogTalk objects encapsulate Prolog first-order language rules as methods.
ru_ru: Объекты LogTalk инкапсулируют правила языка в виде методов.

source: The MDA tools consists of the following main components: source model server (2), which stores and retrieve model data as RDF triples; MDA transformation engine (1), which queries data from the server other SPARQL compliant servers (4); the CIM (3) and PIM (6) model data sources; indexing engine (5), which provides persistent utility means for text data storage and text processing interfaces.
ru_ru: Инструменты MDA состоят из следующих основных компонентов: сервер исходных моделей (2), который хранит модель данных в виде RDF-троек; механизм трансформации (1), который запрашивает данные с сервера моделей и других SPARQL-совместимых серверов (4); конвертеры форматов представления моделей CIM (3) и PIM (6); сервис полнотекстового индекса (5).

source: The SPARQL queries are encapsulated in methods.
ru_ru: Запросы SPARQL инкапсулируются в методах.

source: The analysis of the sources is performed with regular expressions and simple translation units.
ru_ru: Анализ исходного кода выполняется при помощи регулярных выражений и простого синтаксического анализа.

source: The architecture of the transformation tools is based on the provision of uniformity of the transformation rules language and predicate input data representation.
ru_ru: Архитектура средства трансформации основывается на обеспечения единообразия языка правил трансформации язык и [[предикативного]] представления входных данных.

source: The category implies interface of codeobject for the object being enriched with it.
ru_ru: Представленная категория требует, чтобы контекстный объект реализовывал интерфейс codeobject.

source: The code block object have the following interface: {logtalk} :- protocol(code_block_proto).
ru_ru: Итерфейс блока кода имеет следующий вид: {logtalk} :- protocol(code_block_proto).

source: The development tools is being tested in representation of bioinformatic tool Mothur as Rapidminer dataflow diagrams .
ru_ru: Инструменты разработки использованы в создании инструмента представления биоинформатических модулей Mothur в виде dataflow-диаграмм системы Rapidminer <п0>.

source: The encapsulation gave us possibility to hide specialized knowledge behind object interfaces.
ru_ru: Инкапсуляция дает возможность скрывать специальные знаний за интерфейсом объекта.

source: The entity names and their relation expressed with the source notation must be convertible to the RDF definition upon request from transformation engine.
ru_ru: Имена сущностей и их взаимосвязей, представленных в исходном формате визуального редактора, должны быть конвертируемыми в RDF по запросу во время трансформации.

source: The files are transferred between modules.
ru_ru: Файлы передаются между модулями.

source: The first argument of |renderitem/2| is the |item/1|--structure to be rendered, and the second one is the list of strings representing generated source code.
ru_ru: Первый аргумент |renderitem/2| -- это структура из |item/1|, а второй -- список строк, представляющий сгенерированный исходный код.

source: The following example shows rendering class for Python classes.
ru_ru: Следующий пример показывает как происходит порождение класса языка Python.

source: The idea was taken from |llvmlite| library.
ru_ru: Идея взята из реализации блока кода в библиотеке |llvmlite|.

source: The implemented internal logic allowed us to determine some errors in Mothur source module descriptions.
ru_ru: Реализованная внутренняя логика позволила идентифицировать ошибки в исходном коде описаний модулей Mothur: процедура трансформации PIM в PSM для "бракованных" описаний попросту не выполнялась.

source: The kernel of the system is MDA tool, which is a set of transformational modules (T--modules).
ru_ru: Подсистема MDA представляет собой набор модулей трансформации (Т--модули).

source: The language and its engine supports conversion from one XMI model to another one in the same XMI format.
ru_ru: Язык и его интерпретатор поддерживают преобразование из одной модели, сохраненной в формате XMI, в другую в том же формате XMI.

source: The language structures describe recognition of properties of compositions of the source model and direct construction of new structures in the target model.
ru_ru: Структуры языка описывают распознавание свойств композиций элементов исходной модели и построение соответствующих структур в целевой модели.

source: The library imported in LogTalk as an object, that is an encapsulation of all the library predicates.
ru_ru: Библиотеки импортируется в LogTalk как объекты, то есть как инкапсуляции всех библиотечных предикатов.

source: The library represents RDF entities in a W3C compliant way.
ru_ru: Библиотека представляет сущности RDF в виде, рекомендованном W3C.

source: The library represents URI as a corresponding functor with atom argument.
ru_ru: Библиотека представляет URI при помощи функтора с аргументом -- атомом.

source: The library support queries for the graphs as a predicate query and as SPARQL.
ru_ru: Библиотека поддерживает запросы к графам в виде комбинации предикатов или на языке SPARQL.

source: The logic of some Mothur modules functioning requires to make flexible set of output connection to make usage of complex modules to be more convenient for end user.
ru_ru: По логике некоторых модулей Mothur заложена гибкая функциональность: набор выходных файлов зависит от набора входных и настроек модуля. В идеальном случае в dataflow-блоках необходимо учитывать такие нюансы и предоставлять пользователю комбинации входов и выходов отражающие эти особенности.

source: The main idea behind implementation of transformation engine is an usage of an object logical programming language meeting the following constraints: support multiple sources of model data, first-order language for definition of the transformation, transformation is represented as rules, rules should be encapsulated in objects, objects should query other objects for results, means for transformation configuration and scenario description, knowledge manipulation, including composition, expression and query of RDF entities.
ru_ru: Основная идея реализации механизма преобразования является использование объектного логического языка программирования, который соответствует следующим ограничениям: поддержка нескольких источников данных модели, язык первого порядка для определения трансформации, трансформация представляется в виде правил, правила должны инкапсулироваться в объекты, объекты должны запрашивать другие объекты и получать результат, поддерживать средства конфигурирования сценария трансформации, преобразование структуры знаний, в том числе композиция, оперировать тройками RDF.

source: The modules are implemented as classes in C++ with special structures describing each component so as this description would be allowed for analysis at run-time.
ru_ru: Модули Mothur реализованы в виде классов на C++. При помощи дополнительных структур каждый модуль дополнительно описывается, и эти описания доступны во время выполнения скрипта.

source: The most investigated transformational approach of code generation, that goes beyond the CASE, is Model Driven Architecture (MDA).
ru_ru: Модельно-управляемая архитектура (Model Driven Architecture, MDA) -- это наиболее изученный и развитый трансформационный подход, выходящий за ограничения CASE--систем.

source: The most widely used technology of model transformation is ATL (ATLAS Transformation Language) and its predecessor QVT, an OMG standard .
ru_ru: Наиболее широко используемая технология трансформации моделей -- это ATL (ATLAS Transformation Language) и его предшественник QVT, эти технологии -- стандарт OMG .

source: The object imports category |named|, which defines behavior for named instances.
ru_ru: Объект импортирует категорию |named|, которая определяет поведение поименованных языковых структур (переменных, типов, классов и т.д.).

source: The object queries the Server of domain models, which is built on the base of ClioPatria , other objects and other Ontology servers for structural patterns.
ru_ru: Объект запрашивает у сервера моделей предметной области. Сервер построен на базе системы ClioPatria . Объект может запрашивать также другие объекты и другие сервера онтологий.

source: The objects are represented in the LogTalk programming language.
ru_ru: Объекты представлены в языка программирования LogTalk.

source: The ontologies could be served as RDF--files of triples or with servers having SPARQL endpoints.
ru_ru: Графы хранятся в виде RDF-файлов или загружаются с сервера через точки доступа SPARQL.

source: The paper is considered a highly decoupled distributed event-driven application environment, whose design and functioning is dynamically controlled by its three-level DSL description and MDA transformations, which support change propagation.
ru_ru: В статье рассматривается сильно несвязных распределенных вычислительных сред, управляемых событиями. Состав среды и ее функционирование динамически управляется трехуровневым описанием в DSL и соответствующей трансформацией MDA, поддерживающей распространение изменений (change propagation).

source: The past 20 years of unhurried SW technologies development formed descriptions of commonly used domains and represented them as W3C approved ontologies.
ru_ru: Последние 20 лет разработки технологий СВ привели к созданию стандартов описания большого количества предметных областей, причем большинство из них стандартизованы консорциумом W3C.

source: The popular ways of model transformation, like ATL, are based on transformation one XMI model to another XMI, and then to the code.
ru_ru: Популярные способы трансформации модели, как ATL, основаны на трансформации одной XMI-моделm в другую XMI, а затем уже в код.

source: The presented research results is distributed among three grants as follows: aspect of LOD data representation and integration is supported by Russian Science Foundation, grant 18--07--0075; logical inference combining various source models and object--oriented knowledge representation is supported by Russian Foundation of Basic Research, grant 18--71--10001; the presented example of Rapidminer dataflow modules generation is being developed with support of grant of Irkutsk Scientific Center SB RAS, project No 4.2.
ru_ru: Представленные результаты исследований распределена среди трех грантов следующим образом: LOD-- и RDF--представления данных и их интеграция поддержана Российским научным фондом, Грант 18--07--0075; логический вывод в процедуре трансформации над комплексами моделей и объектно-ориентированное представление знаний -- поддержка Российского фонда фундаментальных исследований, Грант 18--71--10001; представленный пример Rapidminer разрабатывается при поддержке гранта Иркутского научного центра СО РАН, проект № 4.2.

source: The previous listing uses static parameterized object |query/1|, whose context argument is a graph representing model under transformation.
ru_ru: Предыдущий листинг использует статический параметризованный объект |query/1|, с контекст-аргументом -- графом, представляющим трансформируемую модельно.

source: The problem of software modeling having various models as sources and its transformation based on logical inference is considered.
ru_ru: Рассматривается задача моделирования программного обеспечения, которая представлена набором исходных моделей, а трансформация -- на основе логического вывода.

source: The procedure is represented as dataflow diagram constructed and evaluated in Rapidminer system.
ru_ru: Процедура представлена в виде диаграммы потоков данных (dataflow diagram), они визуально конструируются и исполняются в системе Rapidminer.

source: The process of tradition programming should allow us to develop specialized versions for peculiar software design approaches, with conserving common practices as libraries.
ru_ru: Программирование трансформаций необходимо стелать близким к обычному традиционной программированию, позволяющему, в частности, создавать из существующих специализированные версии, а также накапливать опыт в библиотеках объектов и компонент.

source: The proposed technique is applied in developing software for visual scripting NGS computational procedures such as sequencing data loading, filtering, gene alignment, result assessment .
ru_ru: Предложенная методика применяется при разработке программного обеспечения для проектирования визуальных сценариев вычислительных процедур в NGS, таких как загрузки данных секвенирования, фильтрации, выравнивания гена, оценки качества результата .

source: The references of an entity of a model from another model can be done as RDF names of a form <prefix>:<identifier>, where <prefix> is the prefix of the model, where <identifier> is defined.
ru_ru: Межмодельные ссылки также делаются при помощи URI или префиксной формы RDF <prefix>:<identifier>, где <prefix> -- это аббревиатура подграфа, представляющего модель, в которой задан <identifier>.

source: The relation refers to a literal string with a corresponding name in a natural language (defined by an attribute).
ru_ru: Субъектом отношения является URI сущности, а объектом -- литерал (строка) и метка естественного языка, задаваемая дополнительным атрибутом.

source: The result is a Rapidminer plug-in, with each Mothur module being represented as a data block.
ru_ru: В результате был синтезирован модуль Rapidminer, в котором все модули Mothur представлены в виде блоков.

source: The role of an object is defined with relation to other objects, e.g., instances of a class are the objects, which are |instantiates/1| its class.
ru_ru: Роль объекта полностью определяется системой отношений с другими объектами, например, экземпляры классов -- это объекты, состоящие в отношении |instantiates/1| со своим классом.

source: The same is used to describe relations between use cases in Use Case diagram.
ru_ru: Те же идею используются, чтобы описать связи между вариантами использования в UML-диаграмме вариантов использования.

source: The second category definition as well as all the sources of transformation objects are stored at github.com .
ru_ru: Текст другой категории и тексты остальных объектов трансформации хранятся на сервере github.com .

source: The source code and initial data are produced from a Platform Specific Model (PSM) that represents IS implementation on a specific program and hardware platform.
ru_ru: Код генерируется из так называемой платформо-зависимой модели (Platform Specific Model, PSM), которая представляет реализацию ИС с включением специфики программно-аппаратной платформы...

source: The source data for transformation is the module specifications and UML Class Diagram, which organizes submodules in virtual class hierarchies.
ru_ru: Исходные данные для преобразования -- это спецификации модуля и дополнительные диаграмма классов UML, которая организует модули в виртуальную иерархию блоков.

source: The states of the object represent PSM, which is translated into source code and initial data.
ru_ru: Совокупность состояний объектов представляет собой PSM, которая на последнем этапе трансформации преобразуется в исходный код и начальные данные.

source: The type of the element is defined by outer functor of the argument, e.g., we define with |append(attributes(L))| a list |L| of attributes of a class.
ru_ru: Тип элемента определяется его внешним функтором, например, сообщение |append(attributes(L))| добавляет список |L| атрибутов в класс.

source: The usage experience of stereotypes and tag values resulted in recognition of the fact, that assigning a stereotype usually implies definition of a set of regular tag values.
ru_ru: Опыт использования стереотипов и теговых значений показал, что назначение определенного стереотипа, как правило, предполагает определение набора одного и того же перечня теговых значений.

source: The usage of LogTalk language allowed us to use object facilities to structure transformational knowledge, create an instrumental basis for manipulation knowledge sets with object inheritance and composition.
ru_ru: Использование языка LogTalk позволило структурировать трансформационные знания, создать инструментальный базис для внесения модификаций в наборы знаний при помощи наследования и композиции.

source: The visual instrument is intended for biologists allowing them to make bioinformatic exploration themselves.
ru_ru: Визуальный инструмент предназначен для биологов, позволяя им самостоятельно проводить биоинформатические исследования.

source: The visual presentation of transforming rules are used also in .
ru_ru: Визуальное представление правил трансформации используется также в .

source: The way of rendering the sources is implemented by subclassing the object and realizing |render/1| and |renderitem/2|.
ru_ru: Генерация исходного кода реализуется при наследовании, при этом надо добавить правила, соответствующие новым структурам: |render/1| и |renderitem/2|.

source: Their main role is structuring Prolog rule set.
ru_ru: Их основная задача -- структурировать множества правил Prolog.

source: There is a basic query optimization.
ru_ru: Реализована базовая оптимизация запросов.

source: These objects enables programmer to define recognition rules over set of structures provided it with parameters.
ru_ru: Такие объекты дают инструмент создания правил распознавания структур в некотором окружении (контексте), задаваемыми параметрами объекта.

source: These patterns are analyzed and the results are stored as the objects states, e.g., cashed in the indexing engine.
ru_ru: В полученные данные о структуре моделей анализируются и распознаются заданные структурные комбинации. Результаты кэшируются в состояниях объектов или индексирутся механизмом индексирования текстов.

source: These properties are implemented as two categories.
ru_ru: Эти свойства реализуются в категориях

source: This allows us represent the transformation as a scenario of objects exchanging messages, querying a SW graph fact database on model structures and SW data.
ru_ru: Это позволяет нам представлять трансформации как сценарии из объектов, обменивающихся сообщениям и запрашивающих модельные данные из графа СВ.

source: This approach makes the input stage modular, and, consequently, easier extensible with new model types.
ru_ru: Такой подход позволяет расширять инструмент новыми видами моделями благодаря такой модульности.

source: This approach requires one-time programming for adaptation of the sources, but for each new version of the library we can obtain new version of the PSM without additional analysis.
ru_ru: Этот подход требует один раз запрограммировать такой конвертер, и при выпуске новой версии библиотеки мы автоматом получаем новую версию PIM.

source: This information can be used to describe user interface properties of the program objects, and referred by URI's from devised models.
ru_ru: Эта информация может быть использована для описания свойств элементов пользовательского интерфейса для редактирования объектов ИС, заданных в исходной модели.
